const qnaList = [
  {
    q: "1. 나, 친구, 애인 셋이 밥먹는데 친구가 먹으려는 깻잎 잡아주기 가능?",
    a: [
      {
        answer: "a. 뭐 어때 가능하지",
        type: [0],
      },
      {
        answer: "b. 미쳤어? 절대 없어",
        type: [1],
      },
    ],
  },
  {
    q: "2. 애인이 이성의 롱패딩 잠궈주기 가능?",
    a: [
      {
        answer: "a. 추우면 뭐... 가능하지",
        type: [0],
      },
      {
        answer: "b. 롱패딩으로 맞고싶냐?",
        type: [1],
      },
    ],
  },
  {
    q: "3. 애인이 이성과 단 둘이 저녁먹기 가능?",
    a: [
      {
        answer: "a. 친구라는데..점심 괜찮지",
        type: [0],
      },
      {
        answer: "b. 점심 먹고 나랑 헤어지면 돼",
        type: [1],
      },
    ],
  },
  {
    q: "4. 애인이 이성과 자취방에서 술먹기 가능?",
    a: [
      {
        answer: "a. 뭐 술? 난 내 애인을 믿어 가능해",
        type: [0],
      },
      {
        answer: "b. 갈거면 나를 사뿐히 즈려밟고 가",
        type: [1],
      },
    ],
  },
  {
    q: "5. 애인이 이성과 여행 가능?",
    a: [
      {
        answer: "a. 여행...재밌겠다 잘 다녀와 ^^",
        type: [0],
      },
      {
        answer: "b. 그게 가능하겠냐 ㅅㅂ?",
        type: [1],
      },
    ],
  },

  {
    q: "애인이 이성과 포옹 가능?",
    a: [
      {
        answer: "a. 가벼운 스킨십 가능이지!",
        type: [0],
      },
      {
        answer: "b. 손가락을 잘라버릴까보다",
        type: [1],
      },
    ],
  },
  {
    q: "7. 애인이 이성과 팔짱끼기 가능?",
    a: [
      {
        answer: "a. 술마시면 뭐 할 수 있지!",
        type: [0],
      },
      {
        answer: "b. 뒤질래?",
        type: [1],
      },
    ],
  },
  {
    q: "8. 애인이 이성과 놀이동산 가능?",
    a: [
      {
        answer: "a. 놀이동산 재밌겠다! 잘갔다와~~",
        type: [0],
      },
      {
        answer: "그냥 그럴거면 둘이 사귀세요~",
        type: [1],
      },
    ],
  },
  {
    q: "9. 애인이 클럽 가능?",
    a: [
      {
        answer: "a. 읍악 재밌겠다! 갈 수있지!!",
        type: [0],
      },
      {
        answer: "b. 어 가 나도 헌포 갈게 ^^",
        type: [1],
      },
    ],
  },
  {
    q: "10. 애인이 술먹고 연락 안되는 가능?",
    a: [
      {
        answer: "a. 피곤했나봐ㅜㅜ 잘 자겠지 ㅎㅎ",
        type: [0],
      },
      {
        answer: "b. 집 찾아가서 부순다",
        type: [1],
      },
    ],
  },
];

//b가 많으면 질투 점수가 높은 것!
const infoList = [
  {
    name: "1점",
    desc: ". 당신 애인 맞음? 안좋아하는듯~",
  },
  {
    name: "2점",
    desc: "정으로 만나는구나...?",
  },
  {
    name: "3점",
    desc: "사귀기는 하는데...이상해...",
  },
  {
    name: "4점",
    desc: "애인이 분명 왜 질투 안하냐고 할텐데...흠",
  },
  {
    name: "5점",
    desc: "이정도 질투는 있어야 사귀는 사이고 좋아한다고 봐야지...",
  },
  {
    name: "6점",
    desc: "질투가 좀 있는듯?",
  },
  {
    name: "7점",
    desc: "구속 가능성이 있어...",
  },
  {
    name: "8점",
    desc: "흠.. 애인이 불쌍해",
  },
  {
    name: "9점",
    desc: "질투 좀 적당히 하세요~~~",
  },
  {
    name: "10점",
    desc: "그냥 헤어져",
  },
];
